spec/cassettes/Viewing_payment_index_page/as_a_student/after_a_payment_has_been_made_with_credit_card/shows_payment_history_with_correct_charge_and_status.yml

---
http_interactions:
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards
    body:
      encoding: UTF-8
      string: '{"number":"4111111111111111","expiration_month":"12","expiration_year":"2020","cvv":"123"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Content-Type:
      - application/json
      Date:
      - Mon, 17 Nov 2014 23:02:32 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMcfdc9e6c6ead11e49f9802a1fe53e539
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.10.4
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhSVhQAQhhQEAMCFlVAFEIIFBQCHVELVQhQBVtcBAFUVlQNBQhQTUIFCA5KRBMBUABTUVEEUA4ADw8AVwFWG00RB1IOF1Nq
      Content-Length:
      - '1266'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "cards": [
            {
              "links": {
                "customer": null
              },
              "fingerprint": "b3ecb5551877e4c9ee9937f74cffbcfacc388e575cb4c061c30f8a32d340001b",
              "cvv_result": "Match",
              "number": "xxxxxxxxxxxx1111",
              "avs_postal_match": null,
              "expiration_month": 12,
              "meta": {},
              "id": "CC6kGCREJ7g5jzSvjr7l5ZjL",
              "category": "other",
              "type": "credit",
              "cvv_match": "yes",
              "bank_name": "JPMORGAN CHASE BANK, N.A.",
              "avs_street_match": null,
              "brand": "Visa",
              "updated_at": "2014-11-17T23:03:12.731866Z",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "name": null,
              "expiration_year": 2020,
              "cvv": "xxx",
              "is_verified": true,
              "avs_result": null,
              "can_credit": false,
              "href": "/cards/CC6kGCREJ7g5jzSvjr7l5ZjL",
              "created_at": "2014-11-17T23:03:12.731864Z"
            }
          ],
          "links": {
            "cards.card_holds": "/cards/{cards.id}/card_holds",
            "cards.customer": "/customers/{cards.customer}",
            "cards.disputes": "/cards/{cards.id}/disputes",
            "cards.debits": "/cards/{cards.id}/debits"
          }
        }
    http_version: 
  recorded_at: Mon, 17 Nov 2014 23:02:33 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards/CC6kGCREJ7g5jzSvjr7l5ZjL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Mon, 17 Nov 2014 23:02:33 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMd0589e9a6ead11e4a3de02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.10.4
      Content-Length:
      - '565'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "cards": [
            {
              "links": {
                "customer": null
              },
              "fingerprint": "b3ecb5551877e4c9ee9937f74cffbcfacc388e575cb4c061c30f8a32d340001b",
              "cvv_result": "Match",
              "number": "xxxxxxxxxxxx1111",
              "avs_postal_match": null,
              "expiration_month": 12,
              "meta": {},
              "id": "CC6kGCREJ7g5jzSvjr7l5ZjL",
              "category": "other",
              "type": "credit",
              "cvv_match": "yes",
              "bank_name": "JPMORGAN CHASE BANK, N.A.",
              "avs_street_match": null,
              "brand": "Visa",
              "updated_at": "2014-11-17T23:03:12.731866Z",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "name": null,
              "expiration_year": 2020,
              "cvv": "xxx",
              "is_verified": true,
              "avs_result": null,
              "can_credit": false,
              "href": "/cards/CC6kGCREJ7g5jzSvjr7l5ZjL",
              "created_at": "2014-11-17T23:03:12.731864Z"
            }
          ],
          "links": {
            "cards.card_holds": "/cards/{cards.id}/card_holds",
            "cards.customer": "/customers/{cards.customer}",
            "cards.disputes": "/cards/{cards.id}/disputes",
            "cards.debits": "/cards/{cards.id}/debits"
          }
        }
    http_version: 
  recorded_at: Mon, 17 Nov 2014 23:02:33 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards
    body:
      encoding: UTF-8
      string: '{"number":"4111111111111111","expiration_month":"12","expiration_year":"2020","cvv":"123"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Content-Type:
      - application/json
      Date:
      - Mon, 17 Nov 2014 23:02:34 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMd09669786ead11e4979802a1fe52a36c
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.10.4
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhSVhQAQhhQEAMCFlVAFEIIFBQCHVYBWANSB1JSAAdRX1YKAgVIQVAOCBtGRlQBVlpXUloCUQ0ADlpRBAVHFUFXAF8RAWs=
      Content-Length:
      - '1266'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "cards": [
            {
              "links": {
                "customer": null
              },
              "fingerprint": "b3ecb5551877e4c9ee9937f74cffbcfacc388e575cb4c061c30f8a32d340001b",
              "cvv_result": "Match",
              "number": "xxxxxxxxxxxx1111",
              "avs_postal_match": null,
              "expiration_month": 12,
              "meta": {},
              "id": "CC6lY66NSM20uUh4b8ILvFwA",
              "category": "other",
              "type": "credit",
              "cvv_match": "yes",
              "bank_name": "JPMORGAN CHASE BANK, N.A.",
              "avs_street_match": null,
              "brand": "Visa",
              "updated_at": "2014-11-17T23:03:13.873710Z",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "name": null,
              "expiration_year": 2020,
              "cvv": "xxx",
              "is_verified": true,
              "avs_result": null,
              "can_credit": false,
              "href": "/cards/CC6lY66NSM20uUh4b8ILvFwA",
              "created_at": "2014-11-17T23:03:13.873709Z"
            }
          ],
          "links": {
            "cards.card_holds": "/cards/{cards.id}/card_holds",
            "cards.customer": "/customers/{cards.customer}",
            "cards.disputes": "/cards/{cards.id}/disputes",
            "cards.debits": "/cards/{cards.id}/debits"
          }
        }
    http_version: 
  recorded_at: Mon, 17 Nov 2014 23:02:34 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards/CC6lY66NSM20uUh4b8ILvFwA
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Mon, 17 Nov 2014 23:02:34 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMd11300466ead11e4bd6f02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.10.4
      Content-Length:
      - '565'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "cards": [
            {
              "links": {
                "customer": null
              },
              "fingerprint": "b3ecb5551877e4c9ee9937f74cffbcfacc388e575cb4c061c30f8a32d340001b",
              "cvv_result": "Match",
              "number": "xxxxxxxxxxxx1111",
              "avs_postal_match": null,
              "expiration_month": 12,
              "meta": {},
              "id": "CC6lY66NSM20uUh4b8ILvFwA",
              "category": "other",
              "type": "credit",
              "cvv_match": "yes",
              "bank_name": "JPMORGAN CHASE BANK, N.A.",
              "avs_street_match": null,
              "brand": "Visa",
              "updated_at": "2014-11-17T23:03:13.873710Z",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "name": null,
              "expiration_year": 2020,
              "cvv": "xxx",
              "is_verified": true,
              "avs_result": null,
              "can_credit": false,
              "href": "/cards/CC6lY66NSM20uUh4b8ILvFwA",
              "created_at": "2014-11-17T23:03:13.873709Z"
            }
          ],
          "links": {
            "cards.card_holds": "/cards/{cards.id}/card_holds",
            "cards.customer": "/customers/{cards.customer}",
            "cards.disputes": "/cards/{cards.id}/disputes",
            "cards.debits": "/cards/{cards.id}/debits"
          }
        }
    http_version: 
  recorded_at: Mon, 17 Nov 2014 23:02:34 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards/CC6lY66NSM20uUh4b8ILvFwA
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Mon, 17 Nov 2014 23:02:34 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMd1410ef06ead11e4a3de02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.10.4
      Content-Length:
      - '565'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "cards": [
            {
              "links": {
                "customer": null
              },
              "fingerprint": "b3ecb5551877e4c9ee9937f74cffbcfacc388e575cb4c061c30f8a32d340001b",
              "cvv_result": "Match",
              "number": "xxxxxxxxxxxx1111",
              "avs_postal_match": null,
              "expiration_month": 12,
              "meta": {},
              "id": "CC6lY66NSM20uUh4b8ILvFwA",
              "category": "other",
              "type": "credit",
              "cvv_match": "yes",
              "bank_name": "JPMORGAN CHASE BANK, N.A.",
              "avs_street_match": null,
              "brand": "Visa",
              "updated_at": "2014-11-17T23:03:13.873710Z",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "name": null,
              "expiration_year": 2020,
              "cvv": "xxx",
              "is_verified": true,
              "avs_result": null,
              "can_credit": false,
              "href": "/cards/CC6lY66NSM20uUh4b8ILvFwA",
              "created_at": "2014-11-17T23:03:13.873709Z"
            }
          ],
          "links": {
            "cards.card_holds": "/cards/{cards.id}/card_holds",
            "cards.customer": "/customers/{cards.customer}",
            "cards.disputes": "/cards/{cards.id}/disputes",
            "cards.debits": "/cards/{cards.id}/debits"
          }
        }
    http_version: 
  recorded_at: Mon, 17 Nov 2014 23:02:35 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/cards/CC6lY66NSM20uUh4b8ILvFwA/debits
    body:
      encoding: UTF-8
      string: '{"amount":61821,"appears_on_statement_as":"Epicodus tuition"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.1
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Mon, 17 Nov 2014 23:02:35 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMd1711cda6ead11e4bd6f02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP25WywsPx8EeGEUdXq7NHPH
      X-Balanced-Merchant:
      - TEST-MR25szSXTcDDLogl9uXOlFKV
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.10.4
      Content-Length:
      - '1085'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "debits": [
            {
              "status": "succeeded",
              "description": null,
              "links": {
                "customer": null,
                "source": "CC6lY66NSM20uUh4b8ILvFwA",
                "card_hold": "HL6nicKtZnCsMahJCs8xdkSV",
                "order": null,
                "dispute": null
              },
              "updated_at": "2014-11-17T23:03:15.845733Z",
              "created_at": "2014-11-17T23:03:15.094128Z",
              "transaction_number": "WC1U-4E4-WJ2C",
              "failure_reason": null,
              "currency": "USD",
              "amount": 61821,
              "failure_reason_code": null,
              "meta": {},
              "href": "/debits/WD6nkGiEOdG8Zk2e8T6eYT1H",
              "appears_on_statement_as": "BAL*Epicodus tuition",
              "id": "WD6nkGiEOdG8Zk2e8T6eYT1H"
            }
          ],
          "links": {
            "debits.customer": "/customers/{debits.customer}",
            "debits.order": "/orders/{debits.order}",
            "debits.dispute": "/disputes/{debits.dispute}",
            "debits.source": "/resources/{debits.source}",
            "debits.events": "/debits/{debits.id}/events",
            "debits.refunds": "/debits/{debits.id}/refunds",
            "debits.card_hold": "/holds/{debits.card_hold}"
          }
        }
    http_version: 
  recorded_at: Mon, 17 Nov 2014 23:02:36 GMT
- request:
    method: post
    uri: https://api:<MAILGUN_API_KEY>@api.mailgun.net/v2/epicodus.com/messages
    body:
      encoding: US-ASCII
      string: from=michael%40epicodus.com&to=student4%40example.com&bcc=michael%40epicodus.com&subject=Epicodus%20tuition%20payment%20receipt&text=Hi%20Example%20Brown%204.%20This%20is%20to%20confirm%20your%20payment%20of%20%24618.21%20for%20Epicodus%20tuition.%20If%20you%20have%20any%20questions%2C%20reply%20to%20this%20email.%20Thanks!
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Content-Length:
      - '325'
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx/1.4.7
      Date:
      - Mon, 17 Nov 2014 23:02:36 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '90'
      Connection:
      - keep-alive
      Content-Disposition:
      - inline
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '600'
      Access-Control-Allow-Methods:
      - GET, POST, PUT, DELETE, OPTIONS
      Access-Control-Allow-Headers:
      - Content-Type, x-requested-with
    body:
      encoding: UTF-8
      string: |-
        {
          "message": "Queued. Thank you.",
          "id": "<20141117230236.15637.46531@epicodus.com>"
        }
    http_version: 
  recorded_at: Mon, 17 Nov 2014 23:02:37 GMT
recorded_with: VCR 2.9.3
